#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=b82f08c474da3ac3867bab4915f23c2a2653ba19]
local_file.tfkey: Refreshing state... [id=7c0c732a82739692968e1c48ee30ce17d8d118d2]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_vpc.main: Refreshing state... [id=vpc-0f0937681e2a03404]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0ed3fe0aa6660aaf7]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0937bfb563428bfe9]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-044aeee947e08bce0]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0cdfe3aae56d99be7]
aws_security_group.elb: Refreshing state... [id=sg-055535bfe143cdce7]
aws_security_group.allow_http: Refreshing state... [id=sg-05be6488e8f968018]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-09544529ed29bef83]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-052fb1d6dc8f7ac0a]
aws_security_group.allow_ssh: Refreshing state... [id=sg-04622f925cc8baa22]
aws_route_table.public_route_table: Refreshing state... [id=rtb-07cb130dbaf445768]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-053b44dbf2b242f0d]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-06a5b649bc9f32edc]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-018d333edd57297bd]
aws_route_table.private_route_table: Refreshing state... [id=rtb-00a63ca5443541aad]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0e73ad4d75f927c75]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-03fc774b1c5170a5f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = (known after apply)
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be created
  + resource "aws_autoscaling_group" "auto_scaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "Auto Scaling Group"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-044aeee947e08bce0",
          + "subnet-052fb1d6dc8f7ac0a",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "App Server"
        }
    }

  # aws_instance.bastion-host will be created
  + resource "aws_instance" "bastion-host" {
      + ami                                  = "ami-06502636b721ace34"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0937bfb563428bfe9"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-04622f925cc8baa22",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_launch_configuration.ec2_config will be created
  + resource "aws_launch_configuration" "ec2_config" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-06502636b721ace34"
      + instance_type               = "t2.micro"
      + key_name                    = "terraform_key"
      + name                        = (known after apply)
      + name_prefix                 = (known after apply)
      + security_groups             = [
          + "sg-04622f925cc8baa22",
          + "sg-055535bfe143cdce7",
          + "sg-05be6488e8f968018",
        ]
      + user_data                   = "c0474efef832d7529152836d553c672a37995254"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*